Siege/ab_logi_100_4000/log_search_ab_1200.log
This is ApacheBench, Version 2.3 <$Revision: 1903618 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 127.0.0.1 (be patient)
Completed 5000 requests
Completed 10000 requests
Completed 15000 requests
Completed 20000 requests
Finished 20306 requests


Server Software:        gunicorn
Server Hostname:        127.0.0.1
Server Port:            8000

Document Path:          /api/property/search/?city=Warszawa&region=Mazowieckie&maxP=330
Document Length:        15905 bytes

Concurrency Level:      1200
Time taken for tests:   60.009 seconds
Complete requests:      20306
Failed requests:        0
Total transferred:      329546074 bytes
HTML transferred:       322966930 bytes
Requests per second:    338.38 [#/sec] (mean)
Time per request:       3546.305 [ms] (mean)
Time per request:       2.955 [ms] (mean, across all concurrent requests)
Transfer rate:          5362.87 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    3  12.0      0      65
Processing:    36 3439 539.4   3447    4377
Waiting:        9 3439 539.5   3446    4376
Total:        101 3442 529.0   3447    4377

Percentage of the requests served within a certain time (ms)
  50%   3447
  66%   3478
  75%   3536
  80%   3556
  90%   3901
  95%   4101
  98%   4235
  99%   4327
 100%   4377 (longest request)