Siege/ab_logi_100_4000/log_search_ab_1500.log
This is ApacheBench, Version 2.3 <$Revision: 1903618 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 127.0.0.1 (be patient)
Completed 5000 requests
Completed 10000 requests
Completed 15000 requests
Completed 20000 requests
Finished 20737 requests


Server Software:        gunicorn
Server Hostname:        127.0.0.1
Server Port:            8000

Document Path:          /api/property/search/?city=Warszawa&region=Mazowieckie&maxP=330
Document Length:        15905 bytes

Concurrency Level:      1500
Time taken for tests:   60.005 seconds
Complete requests:      20737
Failed requests:        0
Total transferred:      336540773 bytes
HTML transferred:       329821985 bytes
Requests per second:    345.59 [#/sec] (mean)
Time per request:       4340.437 [ms] (mean)
Time per request:       2.894 [ms] (mean, across all concurrent requests)
Transfer rate:          5477.09 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    5  16.6      0      79
Processing:    43 4177 652.6   4306    4467
Waiting:        8 4177 652.6   4305    4467
Total:        122 4182 637.3   4306    4467

Percentage of the requests served within a certain time (ms)
  50%   4306
  66%   4346
  75%   4388
  80%   4402
  90%   4417
  95%   4431
  98%   4439
  99%   4443
 100%   4467 (longest request)