Siege/ab_logi_100_4000/log_search_ab_2800.log
This is ApacheBench, Version 2.3 <$Revision: 1903618 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 127.0.0.1 (be patient)
Completed 5000 requests
Completed 10000 requests
Completed 15000 requests
Finished 16370 requests


Server Software:        gunicorn
Server Hostname:        127.0.0.1
Server Port:            8000

Document Path:          /api/property/search/?city=Warszawa&region=Mazowieckie&maxP=330
Document Length:        15905 bytes

Concurrency Level:      2800
Time taken for tests:   60.000 seconds
Complete requests:      16370
Failed requests:        0
Total transferred:      265668730 bytes
HTML transferred:       260364850 bytes
Requests per second:    272.83 [#/sec] (mean)
Time per request:       10262.676 [ms] (mean)
Time per request:       3.665 [ms] (mean, across all concurrent requests)
Transfer rate:          4324.04 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0   25  66.1      0     260
Processing:   232 6614 2891.2   6007   57781
Waiting:      232 6614 2891.2   6007   57780
Total:        492 6639 2861.3   6009   57889

Percentage of the requests served within a certain time (ms)
  50%   6009
  66%   6068
  75%   6140
  80%   6176
  90%  10383
  95%  14145
  98%  14339
  99%  14377
 100%  57889 (longest request)